Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/include/pio/pic32cm2532ls60064.h
#define PIN_PA09B_ADC_AIN7                         _UINT32_(9) 
#define MUX_PA09B_ADC_AIN7                         _UINT32_(1) 
#define PINMUX_PA09B_ADC_AIN7                      ((PIN_PA09B_ADC_AIN7 << 16) | MUX_PA09B_ADC_AIN7)
#define PORT_PA09B_ADC_AIN7                        (_UINT32_(1) << 9)

#define PIN_PA10B_ADC_AIN8                         _UINT32_(10)
#define MUX_PA10B_ADC_AIN8                         _UINT32_(1) 
#define PINMUX_PA10B_ADC_AIN8                      ((PIN_PA10B_ADC_AIN8 << 16) | MUX_PA10B_ADC_AIN8)
#define PORT_PA10B_ADC_AIN8                        (_UINT32_(1) << 10)

#define PIN_PA11B_ADC_AIN9                         _UINT32_(11)
#define MUX_PA11B_ADC_AIN9                         _UINT32_(1) 
#define PINMUX_PA11B_ADC_AIN9                      ((PIN_PA11B_ADC_AIN9 << 16) | MUX_PA11B_ADC_AIN9)
#define PORT_PA11B_ADC_AIN9                        (_UINT32_(1) << 11)

#define PIN_PB02B_ADC_AIN10                        _UINT32_(34)
#define MUX_PB02B_ADC_AIN10                        _UINT32_(1) 
#define PINMUX_PB02B_ADC_AIN10                     ((PIN_PB02B_ADC_AIN10 << 16) | MUX_PB02B_ADC_AIN10)
#define PORT_PB02B_ADC_AIN10                       (_UINT32_(1) << 2)

#define PIN_PB03B_ADC_AIN11                        _UINT32_(35)
#define MUX_PB03B_ADC_AIN11                        _UINT32_(1) 
#define PINMUX_PB03B_ADC_AIN11                     ((PIN_PB03B_ADC_AIN11 << 16) | MUX_PB03B_ADC_AIN11)
#define PORT_PB03B_ADC_AIN11                       (_UINT32_(1) << 3)

#define PIN_PB04B_ADC_AIN12                        _UINT32_(36)
#define MUX_PB04B_ADC_AIN12                        _UINT32_(1) 
#define PINMUX_PB04B_ADC_AIN12                     ((PIN_PB04B_ADC_AIN12 << 16) | MUX_PB04B_ADC_AIN12)
#define PORT_PB04B_ADC_AIN12                       (_UINT32_(1) << 4)

#define PIN_PB05B_ADC_AIN13                        _UINT32_(37)
#define MUX_PB05B_ADC_AIN13                        _UINT32_(1) 
#define PINMUX_PB05B_ADC_AIN13                     ((PIN_PB05B_ADC_AIN13 << 16) | MUX_PB05B_ADC_AIN13)
#define PORT_PB05B_ADC_AIN13                       (_UINT32_(1) << 5)

#define PIN_PB06B_ADC_AIN14                        _UINT32_(38)
#define MUX_PB06B_ADC_AIN14                        _UINT32_(1) 
#define PINMUX_PB06B_ADC_AIN14                     ((PIN_PB06B_ADC_AIN14 << 16) | MUX_PB06B_ADC_AIN14)
#define PORT_PB06B_ADC_AIN14                       (_UINT32_(1) << 6)

#define PIN_PB07B_ADC_AIN15                        _UINT32_(39)
#define MUX_PB07B_ADC_AIN15                        _UINT32_(1) 
#define PINMUX_PB07B_ADC_AIN15                     ((PIN_PB07B_ADC_AIN15 << 16) | MUX_PB07B_ADC_AIN15)
#define PORT_PB07B_ADC_AIN15                       (_UINT32_(1) << 7)

#define PIN_PB00B_ADC_AIN16                        _UINT32_(32)
#define MUX_PB00B_ADC_AIN16                        _UINT32_(1) 
#define PINMUX_PB00B_ADC_AIN16                     ((PIN_PB00B_ADC_AIN16 << 16) | MUX_PB00B_ADC_AIN16)
#define PORT_PB00B_ADC_AIN16                       (_UINT32_(1) << 0)

#define PIN_PB01B_ADC_AIN17                        _UINT32_(33)
#define MUX_PB01B_ADC_AIN17                        _UINT32_(1) 
#define PINMUX_PB01B_ADC_AIN17                     ((PIN_PB01B_ADC_AIN17 << 16) | MUX_PB01B_ADC_AIN17)
#define PORT_PB01B_ADC_AIN17                       (_UINT32_(1) << 1)

#define PIN_PB08B_ADC_AIN18                        _UINT32_(40)
#define MUX_PB08B_ADC_AIN18                        _UINT32_(1) 
#define PINMUX_PB08B_ADC_AIN18                     ((PIN_PB08B_ADC_AIN18 << 16) | MUX_PB08B_ADC_AIN18)
#define PORT_PB08B_ADC_AIN18                       (_UINT32_(1) << 8)

#define PIN_PB09B_ADC_AIN19                        _UINT32_(41)
#define MUX_PB09B_ADC_AIN19                        _UINT32_(1) 
#define PINMUX_PB09B_ADC_AIN19                     ((PIN_PB09B_ADC_AIN19 << 16) | MUX_PB09B_ADC_AIN19)
#define PORT_PB09B_ADC_AIN19                       (_UINT32_(1) << 9)

#define PIN_PA04B_ADC_VREFP                        _UINT32_(4) 
#define MUX_PA04B_ADC_VREFP                        _UINT32_(1) 
#define PINMUX_PA04B_ADC_VREFP                     ((PIN_PA04B_ADC_VREFP << 16) | MUX_PA04B_ADC_VREFP)
#define PORT_PA04B_ADC_VREFP                       (_UINT32_(1) << 4)

/* ========== PORT definition for CCL peripheral ========== */
#define PIN_PA04I_CCL_IN0                          _UINT32_(4) 
#define MUX_PA04I_CCL_IN0                          _UINT32_(8) 
#define PINMUX_PA04I_CCL_IN0                       ((PIN_PA04I_CCL_IN0 << 16) | MUX_PA04I_CCL_IN0)
#define PORT_PA04I_CCL_IN0                         (_UINT32_(1) << 4)

#define PIN_PA16I_CCL_IN0                          _UINT32_(16)
#define MUX_PA16I_CCL_IN0                          _UINT32_(8) 
#define PINMUX_PA16I_CCL_IN0                       ((PIN_PA16I_CCL_IN0 << 16) | MUX_PA16I_CCL_IN0)
#define PORT_PA16I_CCL_IN0                         (_UINT32_(1) << 16)

#define PIN_PB22I_CCL_IN0                          _UINT32_(54)
#define MUX_PB22I_CCL_IN0                          _UINT32_(8) 
#define PINMUX_PB22I_CCL_IN0                       ((PIN_PB22I_CCL_IN0 << 16) | MUX_PB22I_CCL_IN0)
#define PORT_PB22I_CCL_IN0                         (_UINT32_(1) << 22)

#define PIN_PA05I_CCL_IN1                          _UINT32_(5) 
#define MUX_PA05I_CCL_IN1                          _UINT32_(8) 
#define PINMUX_PA05I_CCL_IN1                       ((PIN_PA05I_CCL_IN1 << 16) | MUX_PA05I_CCL_IN1)
#define PORT_PA05I_CCL_IN1                         (_UINT32_(1) << 5)

#define PIN_PA17I_CCL_IN1                          _UINT32_(17)
#define MUX_PA17I_CCL_IN1                          _UINT32_(8) 
#define PINMUX_PA17I_CCL_IN1                       ((PIN_PA17I_CCL_IN1 << 16) | MUX_PA17I_CCL_IN1)
#define PORT_PA17I_CCL_IN1                         (_UINT32_(1) << 17)

#define PIN_PB00I_CCL_IN1                          _UINT32_(32)
#define MUX_PB00I_CCL_IN1                          _UINT32_(8) 
#define PINMUX_PB00I_CCL_IN1                       ((PIN_PB00I_CCL_IN1 << 16) | MUX_PB00I_CCL_IN1)
#define PORT_PB00I_CCL_IN1                         (_UINT32_(1) << 0)

